import { GeneralTextWithImage } from "../TextWithImage/TextWithImage";
import Title from "../title"
import {t} from "i18next";
import TechImg from "../../assets/techImg.png"


const Techs = [
    {
        id : 1,
        name : "اسم التقنية",
        details : [
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
        ],
        TechImg : TechImg
    },
    {
        id : 2,
        name : "اسم التقنية",
        details : [
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
        ],
        TechImg : TechImg
    },
    {
        id : 3,
        name : "اسم التقنية",
        details : [
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."
        ],
        TechImg : TechImg
    },
]
function Technologies() {
  return (
    <div className="Technologies font-[Almarai]">
        <Title 
         mainTitle={t("about.Latest_Technologies")}
         subTitle="هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى"
         StyleText={"text-center "}
         StyleHr={"justify-center"}
         sizeHr={"w-[250px]"}
         />
        <div className="container">
            {Techs.map((tech => 
                <GeneralTextWithImage key={tech.id} imageSrc={tech.TechImg} isImageLeft={true} >
                    <h3 className="text-[#011632] font-bold mb-4 lg:mb-9 text-2xl">{tech.name}</h3>
                    {tech.details.map(((detail,index) => 
                        <p key={index} className="text-[#3C4959] mb-4 lg:mb-9 text-sm lg:text-lg font-normal leading-8 text-start">{detail}</p>
                    ))}
                </GeneralTextWithImage>))}
        </div>

      
    </div>
  )
}

export default Technologies
